import pygame
from pygame.draw import *

pygame.init()

FPS = 30
screen = pygame.display.set_mode((600, 600))
screen.fill((225, 225, 225))
ellipse(screen, (255, 100, 10), (145, 410, 330, 350))
ellipse(screen, (230, 220, 170), (180, 160, 250, 300))
circle(screen, (0, 0, 0), (260, 280), 10)  # глаз слева
circle(screen, (0, 0, 0), (350, 280), 10)  # глаз справа
circle(screen, (0, 0, 255), (260, 280), 25, 15)
circle(screen, (0, 0, 255), (350, 280), 25, 15)
circle(screen, (0, 0, 0), (260, 280), 25, 1)
circle(screen, (0, 0, 0), (350, 280), 25, 1)
polygon(screen, (100, 40, 0), [(290, 310), (320, 310), (305, 340)])  # нос
polygon(screen, (255, 0, 0), [(230, 350), (380, 350), (305, 400)])  # рот
polygon(screen, (0, 0, 0), [(230, 350), (380, 350), (305, 400)], 1)
polygon(screen, (255, 100, 10), ([(210, 400), (250, 450),
                (220, 510), (155, 490), (155, 420)]))  # левое плечо
polygon(screen, (0, 0, 0), ([(210, 400), (250, 450),
                (220, 510), (155, 490), (155, 420)]), 1)  # обводка левого плечо
polygon(screen, (255, 100, 10), ([(401, 400), (451, 420),
                (460, 490), (395, 510), (365, 440)]))   # правое плечо
polygon(screen, (0, 0, 0), ([(401, 400), (451, 420),
                (460, 490), (395, 510), (365, 440)]), 1)  # обводка правого плеча
polygon(screen, (0, 0, 0), ([(175, 412), (195, 405),
              (90, 100), (70, 105)]))
polygon(screen, (0, 0, 0), ([(420, 407), (440, 416),
                (520, 100), (500, 93)]))
ellipse(screen, (255, 100, 10), (60, 60, 50, 70))  # левая рука
ellipse(screen, (255, 100, 10), (480, 60, 50, 70))  # правая рука
line(screen, (0, 255, 0), (35, 60), (565, 60), width=75)
polygon(screen, (0, 0, 0), [(35, 23), (565, 23), (565, 98), (35, 98)], 1)
font = pygame.font.SysFont("comicsansms", 50)
text = font.render("PYTHON is AMAZING", 1,  (0, 0, 0))
screen.blit(text, (35, 25))
polygon(screen, (255, 0, 230), [(170, 210), (210, 215), (190, 250)])  # 1
polygon(screen, (0, 0, 0), [(170, 210), (210, 215), (190, 250)], 1)
polygon(screen, (255, 0, 230), [(183, 190), (225, 200), (200, 230)])  # 2
polygon(screen, (0, 0, 0), [(183, 190), (225, 200), (200, 230)], 1)
polygon(screen, (255, 0, 230), [(196, 170), (240, 185), (210, 215)])  # 3
polygon(screen, (0, 0, 0), [(196, 170), (240, 185), (210, 215)], 1)
polygon(screen, (255, 0, 230), [(215, 150), (255, 175), (225, 202)])  # 4
polygon(screen, (0, 0, 0), [(215, 150), (255, 175), (225, 202)], 1)
polygon(screen, (255, 0, 230), [(245, 130), (290, 160), (240, 184)])  # 5
polygon(screen, (0, 0, 0), [(245, 130), (290, 160), (240, 184)], 1)
polygon(screen, (255, 0, 230), [(295, 115), (325, 160), (270, 164)])  # 6
polygon(screen, (0, 0, 0), [(295, 115), (325, 160), (270, 164)], 1)
polygon(screen, (255, 0, 230), [(345, 120), (355, 175), (300, 160)])  # 7
polygon(screen, (0, 0, 0), [(345, 120), (355, 175), (300, 160)], 1)
polygon(screen, (255, 0, 230), [(400, 145), (395, 205), (340, 166)])  # 8
polygon(screen, (0, 0, 0), [(400, 145), (395, 205), (340, 166)], 1)
polygon(screen, (255, 0, 230), [(440, 190), (420, 245), (380, 190)])  # 9
polygon(screen, (0, 0, 0), [(440, 190), (420, 245), (380, 190)], 1)
pygame.display.update()
clock = pygame.time.Clock()
finished = False

while not finished:
    clock.tick(FPS)
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            finished = True

pygame.quit()
